const sliderRules = {
    title: {
        en: [
            (v: string) => !!v || 'სათაური (ქართ) არის სავალდებულო',
            (v: string) => (v && v.length <= 100) || 'სათაური (ქართ) უნდა იყოს 100 სიმბოლოზე ნაკლები',
        ],
        ka: [
            (v: string) => !!v || 'სათაური (ინგლ) არის სავალდებულო',
            (v: string) => (v && v.length <= 100) || 'სათაური (ინგლ) უნდა იყოს 100 სიმბოლოზე ნაკლები',
        ],
    },
    image: [
        (v: string) => !!v || 'სურათის ველი სავალდებულოა',
        (v: File[]) => (v && v.length > 0) || 'სურათის ველი სავალდებულოა',
    ],
    date: [(v: string) => !!v || 'თარიღის ველი სავალდებულოა'],
}

export default sliderRules;